Tekla Open API Reference for Tekla Structures 2025
NumberingSeries Constructor
Overload List
Name | Description
NumberingSeries()
 Instantiates a default numbering.
NumberingSeries(String, Int32)
 Instantiates a numbering series with the given arguments.
Top
See Also
Reference
NumberingSeries Class
Tekla.Structures.Model Namespace